---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseA
source: html/f6cce876-b1cd-7884-cba4-06c57f790f8e.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseA Property

Circuit Naming by Phase - Phase A Label.

## Syntax (C#)
```csharp
public string CircuitNamePhaseA { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null